Revit 2024 API
Opening.BoundaryCurves Property
 The geometry information for non-rectangular openings in project documents, or for all openings in family documents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurveArray BoundaryCurves { get; }
Visual Basic
Public ReadOnly Property BoundaryCurves As CurveArray
	Get
Visual C++
public:
property CurveArray^ BoundaryCurves {
	CurveArray^ get ();
}
Remarks
If IsRectBoundary is true, this value is null.
See Also
Opening Class
Autodesk.Revit.DB Namespace